
//  1)

// Створити скрипт який виводить спливаюче вікно з запитомна 
// введення імені користувача за допомогою prompt(). Післявведення
// іменівивести повідомлення привітання з використанням 
// введеногоімені.

const requestName = prompt('Як вас звати?');

if (requestName) {
    alert('Привіт,' + requestName + '!');

} else {
    prompt('Як вас звати?');
}



//  2)

// Створити скрипт який виводить спливаюче підтвердження за 
// допомогою confirm(). Якщо користувач підтверджує дію, вивести
//  повідомлення "Дякую за підтвердження!". Якщо користувач
//   відмовляється, вивести повідомлення "Дію відмінено!".

const acception = confirm('Прийняти повідомлення');

if (acception)  {
    alert('Дякую за підтвердження!');
} else {
    alert('Дію відмінено!');
}


//  3)

// Створити скрипт який виводить спливаюче попередження
// за допомогою alert(). Вивести повідомлення про те, що
// дія небезпечна та попросити користувача підтвердити
// дію за допомогою confirm(). Якщо користувач підтверджує
// дію, вивести повідомлення "Дякую за підтвердження!".
// Якщо користувач відмовляється, вивести повідомлення
// "Дію відмінено!".


const warning = alert('ПОПЕЖЕДЖЕННЯ!!');

const confirmDanger = confirm('Дія небезпечна, підтвердіть дію');

if (confirmDanger)  {
    alert("Дякую за підтвердження!");
} else {
    alert("Дію відмінено!");
}



